#สร้างเพื่อใส่ตัวเลข
x = int(input("ตัวเลขที่ 1:\n"))
y = int(input("ตัวเลขที่ 2:\n"))
#นำเสนอว่าสามารถทำอะไรได้บ้าง
print("เลือก Operator")
print("a =นำมาบวกกัน");
print("b =นำมาลบกัน");
print("m =นำมาคูณกัน");
print("d =นำมาหารกัน");
#กำหนดฟังก์ชั่น
a = x+y
s = x-y
m = x*y
d = x/y
#กรอกสิ่งที่ต้องการทำ
n = input("ใส่ Operator: \n")
#กำหนดขอบเขตการทำงาน
if n == "a" or n == "A":
    print("คำตอบคือ",(a))
elif n == 's':
    print("คำตอบคือ",(s))
elif n == 'm':
    print("คำตอบคือ",(m))
elif n == 'd':
    print("คำตอบคือ",(d))
else:
    print("หาค่าไม่ได้")