print("ให้เขียนโปรแกรมคำนวณยอดเงินฝากคิดคิดให้หาดอกเบี้ยตามอัตราดอกเบี้ย ดังนี้")
print("ให้ใช้คำสั่ง IF...Then...Else และโดยรับค่ายอดเงินฝาก ")
print(" เงินฝากมากกว่า 100,000 บาท คิดอัตราดอกเบี้ย ร้อยละ 7 \n เงินฝากระหว่าง 0 - 100,000 คิดอัตราดอกเบี้ย รเอละ 5")
print("โปรแกรมคิดดอกเบี้ย")
price = int(input("กรุณากรอกจำนวนเงิน : "))
if price > 100000:
    print("อัตราดอกเบี้ย ร้อยละ 7 บาท ")
    print("ดอกเบี้ย = " + (price * 0.07))
    print("เงินต้นพร้อมดอกเบี้ย = " + (price + (price * 0.07)))
elif price >= 100000:
     print("อัตราดอกเบี้ย ร้อยละ 5 บาท ")
     print("ดอกเบี้ย = " + (price * 0.05))
     print("เงินต้นพร้อมดอกเบี้ย = " + (price + (price * 0.05)))
